# FPenPat

## Description
<b>Use [[VS:FPenPatN| FPenPatN]]  instead.</b>
Function FPenPat returns the active pen pattern setting.

```pascal
FUNCTION FPenPat : INTEGER;
```

```python
def vs.FPenPat():
    return INTEGER
```

## Examples
==== VectorScript ====
```pascal
CurrPenStyle:=FPenPat;
```
==== Python ====
```python
CurrPenStyle = vs.FPenPat()
```

## See Also
FPenPatN|FPenPatN, PenPatN|PenPatN  from Vectorworks 2013

## Version
Availability: from All Versions, deprecated from Vectorworks 2013

## Category
* Document Attributes